// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.bean.enums.common;

import lombok.Getter;

/**
 * 分享类型枚举
 *
 * @author Tigshop团队
 * @create 2024年12月03日 17:27
 */
@Getter
public enum shareTypeEnum {
    PRODUCT(1, "product", "商品分享"),
    SECKILL(2, "seckill","秒杀活动分享"),
    COUPON(3, "coupon","优惠券活动分享"),
    REDUCE(4, "reduce","满减活动分享"),
    DISCOUNT(5, "discount","满折活动分享"),
    GIVE(6, "give","满赠活动分享"),
    LIMIT_DISCOUNT(7, "limit","限时折扣活动分享"),
    GROUPON(8, "groupon","拼团活动分享"),
    DECORATE(9, "decorate","装修推广分享"),
    PREMIUM_MEMBER(10, "premiumMember", "付费会员卡分享")
    ;

    private final Integer code;
    private final String key;
    private final String desc;

    shareTypeEnum(Integer code, String key, String desc) {
        this.code = code;
        this.key = key;
        this.desc = desc;
    }
}
