// **---------------------------------------------------------------------+
// ** 文件 --
// **---------------------------------------------------------------------+
// ** 版权所有：江西佰商科技有限公司. 官网：https://www.tigshop.com
// **---------------------------------------------------------------------+
// ** 作者：Tigshop团队，yq@tigshop.com
// **---------------------------------------------------------------------+
// ** 提示：Tigshop商城系统为非免费商用系统，未经授权，严禁使用、修改、发布
// **---------------------------------------------------------------------+

package com.tigshop.mapper.lang;

import com.tigshop.bean.model.lang.ImageI18n;
import com.tigshop.mapper.common.BaseMapper;

/**
 * 海外站图片本地化映射
 *
 * @author Tigshop团队
 */
public interface ImageI18nMapper extends BaseMapper<ImageI18n> {
}
